Autodesk.Revit.DB.Architecture.BalusterInfo.TopReferenceName
Represents the name of the reference for the top of this baluster or post.
Remarks:
Two pre-defined reference names can be obtained using Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForHost() or
Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForTopRail().
The rest of valid reference names that are allowed to be used in the setter for TopReferenceName
are the actual names of non-continuous rails Autodesk::Revit::DB::Architecture::NonContinuousRailInfo::Name
in Autodesk::Revit::DB::Architecture::NonContinuousRailStructure
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The name doesn't refer to a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019

Autodesk.Revit.DB.Architecture.BalusterInfo.BaseReferenceName
Represents the name of the reference for the bottom of this baluster or post.
Remarks:
Two pre-defined reference names can be obtained using Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForHost() or
Autodesk::Revit::DB::Architecture::BalusterInfo::getReferenceNameForTopRail().
The rest of valid reference names that are allowed to be used in the setter for BaseReferenceName
are the actual names of non-continuous rails Autodesk::Revit::DB::Architecture::NonContinuousRailInfo::Name
in Autodesk::Revit::DB::Architecture::NonContinuousRailStructure
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The name doesn't refer to a valid reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2019